#pragma once

#include <cstdint>
#include <array>
#include <algorithm>
#include <functional>

#include <utility/const_functions.h>
#include <utility/ring_buffer.h>

#include "gpio.h"
#include "clock_control.h"
#include "system_control.h"


namespace LPC4078 {

  namespace UARTRegister {
    struct RBR {
      uint8_t value;
      uint8_t reserved[3];
    };

  }

  struct UARTRegisterBase {
    union { // 0x000
      union {
        uint32_t RBR; // DLAB = 0. Receiver Buffer Register. Contains the next received character to be read.
        uint32_t THR; // DLAB = 0. Transmit Holding Register. The next character to be transmitted is written here.
      };
      uint32_t DLL;   // DLAB = 1. Divisor Latch LSB. Least significant byte of the baud
                      //          rate divisor value. The full divisor is used to generate a baud
                      //          rate from the fractional rate divider.
    };
    union { // 0x004
      uint32_t DLM;   // DLAB = 1. Divisor Latch MSB. Most significant byte of the baud
                      //          rate divisor value. The full divisor is used to generate a baud
                      //          rate from the fractional rate divider.
      uint32_t IER;   // DLAB = 0. Interrupt Enable Register. Contains individual
                      //          interrupt enable bits for the 7 potential UART1 interrupts.
    };
    union { // 0x008
      uint32_t IIR;   // Interrupt ID Register. Identifies which interrupt(s) are pending.
      uint32_t FCR;   // FIFO Control Register. Controls UART1 FIFO usage and modes.
    };
    uint32_t LCR;         // 0x00C Line Control Register. Contains controls for frame formatting and break generation.
  };

  // Shared registers between all UART peripherals
  struct UARTRegisterBaseExt : public UARTRegisterBase {
    uint32_t SPEC0;       // 0x010
    uint32_t LSR;         // 0x014 Line Status Register. Contains flags for transmit and receive status, including line errors.
    uint32_t SPEC1;       // 0x018
    uint32_t SCR;         // 0x01C Scratch Pad Register. 8-bit temporary storage for software.
    uint32_t ACR;         // 0x020 Auto-baud Control Register. Contains controls for the auto-baud feature.
    uint32_t SPEC2;       // 0x024
    uint32_t FDR;         // 0x028 Fractional Divider Register. Generates a clock input for the baud rate divider.
    uint32_t SPEC3;       // 0x02C
    uint32_t TER;         // 0x030
    uint32_t SPEC5[6];    // 0x034
    uint32_t RS485CTRL;   // 0x04C RS-485/EIA-485 Control. Contains controls to configure various aspects of RS-485/EIA-485 modes.
    uint32_t RSADRMATCH;  // 0x050 RS-485/EIA-485 address match. Contains the address match value for RS-485/EIA-485 mode.
    uint32_t RS485DLY;    // 0x054 RS-485/EIA-485 direction control delay.
  };
  static_assert(sizeof(UARTRegisterBaseExt) == 0x58);

  // Table 369: Register overview: UART1 (base address 0x4001 0000)
  struct UART1Register : public UARTRegisterBase {
    uint32_t MCR;         // 0x010 Modem Control Register. Contains controls for flow control handshaking and loopback mode.
    uint32_t LSR;         // 0x014 Line Status Register. Contains flags for transmit and receive status, including line errors.
    uint32_t MSR;         // 0x018 Modem Status Register. Contains handshake signal status flags.
    uint32_t SCR;         // 0x01C Scratch Pad Register. 8-bit temporary storage for software.
    uint32_t ACR;         // 0x020 Auto-baud Control Register. Contains controls for the auto-baud feature.
    uint32_t RESERVED0;   // 0x024
    uint32_t FDR;         // 0x028 Fractional Divider Register. Generates a clock input for the baud rate divider.
    uint32_t RESERVED1;   // 0x02C
    uint32_t TER;         // 0x030 Transmit Enable Register. Turns off UART transmitter for use with software flow control.
    uint32_t RESERVED[6]; // 0x034
    uint32_t RS485CTRL;   // 0x04C RS-485/EIA-485 Control. Contains controls to configure various aspects of RS-485/EIA-485 modes.
    uint32_t RSADRMATCH;  // 0x050 RS-485/EIA-485 address match. Contains the address match value for RS-485/EIA-485 mode.
    uint32_t RS485DLY;    // 0x054 RS-485/EIA-485 direction control delay.
  };
  static_assert(sizeof(UART1Register) == 0x58);

  // Table 392. Register overview: UART0/2/3 (base address: 0x4000 C000, 0x4008 8000, 0x4009 C000)
  struct UART023Register : public UARTRegisterBase {
    uint32_t RESERVED0;   // 0x010
    uint32_t LSR;         // 0x014 Line Status Register. Contains flags for transmit and receive status, including line errors.
    uint32_t RESERVED1;   // 0x018
    uint32_t SCR;         // 0x01C Scratch Pad Register. 8-bit temporary storage for software.
    uint32_t ACR;         // 0x020 Auto-baud Control Register. Contains controls for the auto-baud feature.
    uint32_t RESERVED2;   // 0x024
    uint32_t FDR;         // 0x028 Fractional Divider Register. Generates a clock input for the baud rate divider.
    uint32_t RESERVED3;   // 0x02C
    uint32_t TER;         // 0x030 Transmit Enable Register. Turns off UART transmitter for use with software flow control.
    uint32_t RESERVED[6]; // 0x034
    uint32_t RS485CTRL;   // 0x04C RS-485/EIA-485 Control. Contains controls to configure various aspects of RS-485/EIA-485 modes.
    uint32_t RSADRMATCH;  // 0x050 RS-485/EIA-485 address match. Contains the address match value for RS-485/EIA-485 mode.
    uint32_t RS485DLY;    // 0x054 RS-485/EIA-485 direction control delay.
  };
  static_assert(sizeof(UART023Register) == 0x58);

  // Table 412. Register overview: UART4 (base address: 0x400A 4000)
  struct UART4Register : public UARTRegisterBase {
    uint32_t RESERVED0;   // 0x010
    uint32_t LSR;         // 0x014 Line Status Register. Contains flags for transmit and receive status, including line errors.
    uint32_t RESERVED1;   // 0x018
    uint32_t SCR;         // 0x01C Scratch Pad Register. 8-bit temporary storage for software.
    uint32_t ACR;         // 0x020 Auto-baud Control Register. Contains controls for the auto-baud feature.
    uint32_t ICR;         // 0x024 IrDA Control Register. Enables and configures the IrDA mode.
    uint32_t FDR;         // 0x028 Fractional Divider Register. Generates a clock input for the baud rate divider.
    uint32_t OSR;         // 0x02C Oversampling register. Controls the degree of oversampling during each bit time.
    uint32_t RESERVED[6]; // 0x030
    uint32_t SCICTRL;     // 0x048 Smart card Interface control register. Enables and configures the smart card Interface feature.
    uint32_t RS485CTRL;   // 0x04C RS-485/EIA-485 Control. Contains controls to configure various aspects of RS-485/EIA-485 modes.
    uint32_t RSADRMATCH;  // 0x050 RS-485/EIA-485 address match. Contains the address match value for RS-485/EIA-485 mode.
    uint32_t RS485DLY;    // 0x054 RS-485/EIA-485 direction control delay.
    uint32_t SYNCCTRL;    // 0x058 Synchronous mode control register.
  };
  static_assert(sizeof(UART4Register) == 0x5C);

  static constexpr std::array<uintptr_t, 5> uart_address = { 0x4000C000, 0x40010000, 0x40088000, 0x4009C000, 0x400A4000 };
  static inline const std::array<volatile UARTRegisterBaseExt * const, 5> uart_base = { reinterpret_cast<volatile UARTRegisterBaseExt*>(uart_address[0]),
                                                                                        reinterpret_cast<volatile UARTRegisterBaseExt*>(uart_address[1]),
                                                                                        reinterpret_cast<volatile UARTRegisterBaseExt*>(uart_address[2]),
                                                                                        reinterpret_cast<volatile UARTRegisterBaseExt*>(uart_address[3]),
